apicov/bluetooth_speaker/hub_s3/sdkconfig.defaults
# Four wires in from the bridge chip, on SPI3 -- SPI2 is the LED strip.
#
# SCK keeps D7, the pad this link used to arrive on as a UART, so one lead of
# the old wiring survives. The other three take what was left: D5 and D2 were
# genuinely spare, and D4 was not.
#
# D4 = GPIO 5 was DANCEFLOOR_MONITOR_GPIO, and taking it ends the marker/monitor
# instrument on the header, because that needs GPIO 4 AND GPIO 5 and only one of
# them survives out here. Four pads had to come from somewhere and this was the
# cheapest of them: the instrument is off (DANCEFLOOR_ENABLE_MARKER defaults to
# n), it needs a wire between two boards that a deployed floor cannot have, and
# nothing in either firmware corrects on it. TRACK DIVERGENCE over WiFi is
# untouched and covers every satellite rather than the one on the bench.
#
# This said "for good" while the board was a Sense and eleven pads was the whole
# of it. On the Plus a monitor pin could go to one of the rear pads (D11-D15 =
# GPIO 38-42) instead, so the instrument is recoverable with a soldering iron.
# Nobody has wanted it enough to do that.
#
# The alternative was D1 = GPIO 2, the LED sync marker, which is enabled in this
# build and is the check that needs no console at all. Keeping a working
# instrument beat keeping a disabled one.
#
# The handshake is the OUTPUT of the four, and it is on D2 = GPIO 3 for that
# reason: 3 is this part's JTAG_SEL strapping pin -- inert unless the
# STRAP_JTAG_SEL eFuse is burned -- and a pin this board drives itself is a
# safer thing to put there than one the bridge is driving while we boot.
CONFIG_DANCEFLOOR_SBC_SPI_SCK_PIN=44
CONFIG_DANCEFLOOR_SBC_SPI_MOSI_PIN=6
CONFIG_DANCEFLOOR_SBC_SPI_CS_PIN=5
CONFIG_DANCEFLOOR_SBC_SPI_HS_PIN=3

# WS2812 data, still via the 74AHCT125 -- the S3 drives 3.3 V exactly as the
# classic ESP32 does, so the level shifter is no less necessary here. Driven
# through SPI2_HOST and the GPIO matrix, which is fine at the ~2.4 MHz the
# WS2812 encoding needs. Never RMT: see architecture.md S12.
CONFIG_DANCEFLOOR_LED_GPIO=1

# gpio_set_level() into IRAM, for the SBC link's handshake.
#
# The two spi_slave callbacks that raise and drop the handshake are IRAM_ATTR
# because they run in interrupt context, and without this that attribute is
# decoration: the callback is in IRAM and the one function it calls is not.
# IDF defaults this off and the cost is a few hundred bytes of IRAM.
#
# It does not make the handshake work with the flash cache disabled -- the
# spi_slave ISR is registered without ESP_INTR_FLAG_IRAM, so a flash write
# defers the interrupt rather than taking it, and the handshake drops late. That
# is the bridge's 100 ms timeout's problem, and it counts what it refuses.
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y

# The LED sync marker, on D1 = GPIO 2, which the Kconfig already defaults to.
#
# Tracked here rather than left to menuconfig because it was ON in this board's
# untracked sdkconfig and was lost the moment that file was regenerated -- the
# same way the "boom" pattern below was lost, for the same reason, and this file
# already carries a paragraph about that. A bench instrument nobody can find the
# switch for is one nobody uses.
#
# It also earned its place in the pin argument above: the four SPI pads were
# chosen to keep this working, and a setting that decided a pin allocation
# should not live somewhere a rebuild can drop it.
CONFIG_DANCEFLOOR_ENABLE_LED_MARKER=y

# The bench marker pins are NOT set here, on purpose.
#
# DANCEFLOOR_MARKER_GPIO and DANCEFLOOR_MONITOR_GPIO both depend on
# DANCEFLOOR_ENABLE_MARKER, which is off, so they are invisible when this file
# is applied and any value given for them here is silently discarded. Enabling
# the marker later would then fall back to the Kconfig defaults -- and the
# classic hub's monitor pin, 21, is this board's onboard LED rather than a pad.
#
# The marker stays at 4 (D3), which is the one number that survived the move.
# The monitor default is 5 (D4), set in main/Kconfig.projbuild where it cannot
# be dropped.
#
# DANCEFLOOR_LED_MARKER_GPIO lives in the shared components/dancefloor_leds/
# Kconfig and needs nothing here either. Its default is 2, which on this board
# is pad D1 -- free, not a strapping pin, and in range. Wire an LED from 3V3
# through a 330 R resistor to that pad; the pin sinks it to light it.
#
# DANCEFLOOR_LED_MARKER_ACTIVE_LOW is what makes that wiring correct rather than
# inverted, and it defaults to y in the shared Kconfig, so it needs nothing here
# either. It is named here only because the failure is deceptive: wrong setting
# means lit for the 960 ms between flashes and dark for the flash, which reads
# as a sync fault beside a correctly wired unit rather than as a wiring error.
#
# Do NOT point it at 21. Seeed documents it as the onboard user LED on every
# variant in the series and this file used to recommend it; it has since been
# seen not to light at all, and the reason was never confirmed -- the LED may
# simply not be on 21 on every board revision. (The other suspect, that the
# Sense's SD slot used 21 for CS, dies with the move to a Plus, which has no card
# reader. The LED still did not light.) Its being active low used to be a second
# reason to avoid it and no longer is. An external LED on D1 avoids the question
# entirely.

# ---------------------------------------------------------------------------
# Carried over, but NOT carried over on evidence
# ---------------------------------------------------------------------------
#
# Keep the lwIP tcpip thread off the core the LED tasks run on.
#
# On the classic hub this was the whole fix for render starvation: wake overshoot
# mean 2057 -> 634 us, pattern arithmetic max 23226 -> 5254 us, late frames
# 10 -> 0. Both parts of that reasoning still hold in principle -- the thread
# still runs at priority 18, above every task this firmware creates, core locking
# is still off so every sendto() blocks in that thread rather than in the caller,
# and this unit still drives ~30x the priority-18 work a satellite does.
#
# What does NOT carry over is the measurement. Those numbers were taken on a
# 240 MHz LX6 with esp-dsp's generic FFT; this is an LX7 with the SIMD path, and
# the starvation may be smaller, absent, or differently shaped. It is set here
# because it was right there and is unlikely to hurt, which is exactly the
# standard architecture.md's postscript says produced most of the wasted effort
# in this project.
#
# Before trusting it, run it both ways and read the vis log line. That is a
# measurement nobody has made on this part.
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y

