apicov/bluetooth_speaker/hub_s3/sdkconfig.defaults
# The three below are PINNED AT THEIR CURRENT VALUES, not tuned. Enabling the
# symbol above would otherwise move all three, and this has to stay a single-
# variable experiment for the same reason the TX buffer count was returned to 32
# further up: the only question being asked here is WHERE WiFi memory comes
# from, and an answer confounded by three other changes is not an answer.
#
# STATIC_RX_BUFFER_NUM would go 10 -> 16, RX_BA_WIN 6 -> 16 (both in
# esp_wifi/Kconfig, defaulted per SPIRAM_TRY_ALLOCATE_WIFI_LWIP). The BA window
# matters on the air, not just in RAM: the satellite is built with 6, and moving
# only this end changes what the two negotiate.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_RX_BA_WIN=6

# CACHE_TX_BUFFER_NUM only exists when the symbol above is set, and defaults to
# 32. It queues upper-layer packets in PSRAM when no static TX buffer is free,
# instead of rejecting them.
#
# WAS 0 DELIBERATELY, on two objections. "Worth trying on its own once the
# fan-out work needs it" is what the note said, and the fan-out work needs it.
#
# The first objection does not survive being checked. "A late audio packet is
# refused at anchor time anyway (ANCHOR_MIN_LEAD_US)" -- but that gate applies
# at STREAM START, not to packets inside a running stream, and the hub stamps
# play_at 200 ms ahead. A packet held a few ms in this queue still arrives with
# ~195 ms of lead and plays normally. The alternative is not a late packet, it
# is no packet: a hole in the sound on every satellite at once, recoverable from
# the FEC only if the NEXT packet gets through, which under a burst of ENOMEM is
# exactly what does not happen.
#
# The second objection stands, and is why this is BACK AT 0 after one run with
# it on: it converts tx-fail into silence, and tx-fail is the counter this whole
# file is written around.
#
# The run with it on (17:52) is the useful negative result. tx-fail did NOT go
# away -- 10 to 58 audio rejections per 20 s window with 32 cache buffers in
# front of them -- which says the constraint is AIRTIME, not buffer count. A
# queue cannot make a stream fit that does not fit; it only delays the moment it
# does not. So the queue was never going to be the fix, and leaving it on now
# would confound the thing that might be: with FEC at 0 an audio packet drops
# from the 1472-byte MTU back to ~851 B, and the question is whether tx-fail
# goes to zero because of that. It cannot be answered through a queue that
# absorbs the evidence either way.
#
# Turn it back on once tx-fail is genuinely 0 and the reason is understood. It
# is free in the pool that matters -- these live in PSRAM, of which the hub has
# 8 MB, while the static buffers are internal SRAM with ~6.7 kB free and a
# largest block of 3584, room for two more of those at most -- so it is worth
# having as burst insurance. It is not worth having as a blindfold.
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=0

# Forward this unit's logs and HEALTH snapshots over the sync socket to a
# laptop collector (see CONFIG_DANCEFLOOR_WIFI_LOGS). Bench only -- off in a
# production flash, where the shipper compiles out entirely. The hub also
# relays every satellite's logs to the collector, so this is the one unit that
# must have it on for centralised capture to work.
CONFIG_DANCEFLOOR_WIFI_LOGS=y

# How many DHCP leases the SoftAP can hand out. IDF's default is 8, which was
# invisible while MAX_CLIENTS was also 8: it agreed by coincidence rather than
# by construction, and nothing named it.
#
# It is the THIRD of three limits that decide how many satellites a floor can
# hold, and the only one whose failure is quiet. The other two -- MAX_CLIENTS
# and wifi_config.ap.max_connection -- refuse a satellite at association, which
# it notices and reports. Running out of leases lets it associate and then gives
# it no address, so the hub sees a station that joined and never probed, and
# n_sta_nolease is the only tell. Kept at MAX_CLIENTS so the three move
# together.
CONFIG_LWIP_DHCPS_MAX_STATION_NUM=15
